var reg = /^1[3-9]\d{9}/;

reg.test("15711092231");

var str1 = 'abab';
var reg1 = /^[a-z][a-z]$/;


let str2 = "21";
var reg2 = /^(0[1-9])|([1-2][0-9])|(3[0-1])$/;
reg2.test(str2);


let str3 = "3";
let reg3 = /^([+-]?)(\d|([1-9]\d+))(\.\d+)?$/;
console.log(reg3.test(str3));


let str4 = "隔壁老张·张三·隔壁老张隔壁老张";
let reg4 = /^([\u4E00-\u9FA5]{2,6})(·[\u4E00-\u9FA5]{2,}){0,6}$/
console.log(reg4.test(str4));

01 - 09
10 - 12

// 410823 19930715 6619
let str5 = "410823199307156629";
// 6位省市  8位年月日  后4位
let reg5 = /^(\d{6})(\d{8})(\d{4})$/;
// 6位省市  4位年 2位月 2位日  后4位
let reg51 = /^(\d{6})((\d{4})(\d{2})(\d{2}))(\d{4})$/;
// ==>6位省市  ==>4位年 2位月 2位日  ==>后2位 后1位 后1位
let reg52 = /^(?:\d{6})(\d{4})(\d{2})(\d{2})\d{2}(\d{1})(?:\d{1}|X)$/;

//                  01-09  10-12
let reg53 = /^(?:\d{6})([1-2]\d{3})(0[1-9]|1[0-2])(0[1-9]|[1-2][0-9]|3[0-1])\d{2}(\d{1})(?:\d{1}|X)$/;

let res = reg53.exec(str5);
let sex = "男";
if (res[4] % 2 == 1) {
    sex = "女";
}

console.log(`出生日期：${res[1]}年${res[2]}月${res[3]}日，性别：${sex}`);